Masmiseim36/nxpSDK/devices/MKW38Z4/drivers/fsl_flexcan.c
    /* Clean Message Buffer content. */
    base->MB[mbIdx].ID    = 0x0;
    base->MB[mbIdx].WORD0 = 0x0;
    base->MB[mbIdx].WORD1 = 0x0;
}

/*!
 * @brief Calculates the segment values for a single bit time for classical CAN
 *
 * @param baudRate The data speed in bps
 * @param tqNum Number of time quantas per bit
 * @param pconfig Pointer to the FlexCAN timing configuration structure.
 *
 */
static void FLEXCAN_GetSegments(uint32_t baudRate, uint32_t tqNum, flexcan_timing_config_t *pconfig)
{
    uint32_t ideal_sp;
    uint32_t p1;

    /* get ideal sample point. */
    if (baudRate >= 1000000UL)
    {
        ideal_sp = IDEAL_SP_LOW;
    }
    else if (baudRate >= 800000UL)
    {
        ideal_sp = IDEAL_SP_MID;
    }
    else
    {
        ideal_sp = IDEAL_SP_HIGH;
    }

    /* distribute time quanta. */
    p1                 = tqNum * (uint32_t)ideal_sp;
    pconfig->propSeg   = 0;
    pconfig->phaseSeg1 = (uint8_t)(p1 / IDEAL_SP_FACTOR - 2UL);
    if (pconfig->phaseSeg1 > (MAX_PSEG1 + MAX_PROPSEG))
    {
        pconfig->phaseSeg1 = MAX_PSEG1;
        pconfig->propSeg   = MAX_PROPSEG;
    }
    else if (pconfig->phaseSeg1 > MAX_PSEG1)
    {
        pconfig->propSeg   = pconfig->phaseSeg1 - MAX_PSEG1;
        pconfig->phaseSeg1 = MAX_PSEG1;
    }
    else
    {
        /* MISRA Rule 15.7 Compatible */
    }

    pconfig->phaseSeg2 = (uint8_t)(tqNum - ((uint32_t)pconfig->phaseSeg1 + (uint32_t)pconfig->propSeg + 4UL));
    assert(pconfig->phaseSeg2 <= MAX_PSEG2);

    /* subtract one TQ for sync seg. */
    /* sjw is 20% of total TQ, rounded to nearest int. */
    pconfig->rJumpwidth = (uint8_t)((tqNum + 4UL) / 5UL - 1UL);
    if (pconfig->rJumpwidth > MAX_RJW)
    {
        pconfig->rJumpwidth = MAX_RJW;
    }
}

/*!
 * @brief Calculates the improved timing values by specific baudrates for classical CAN
 *
 * @param baudRate  The classical CAN speed in bps defined by user
 * @param sourceClock_Hz The Source clock data speed in bps. Zero to disable baudrate switching
 * @param pconfig Pointer to the FlexCAN timing configuration structure.
 *
 * @return TRUE if timing configuration found, FALSE if failed to find configuration
 */
bool FLEXCAN_CalculateImprovedTimingValues(uint32_t baudRate, uint32_t sourceClock_Hz, flexcan_timing_config_t *pconfig)
{
    uint32_t clk;   /* the clock is tqNumb x baudRateFD. */
    uint32_t clk2;  /* the clock2 is clk2 / Pre-scaler Division Factor. */
    uint32_t tqNum; /* Numbers of TQ. */

    /* observe baud rate maximums. */
    assert(baudRate <= MAX_CAN_BAUDRATE);

    /*  Auto Improved Protocal timing for CBT. */
    for (tqNum = CTRL1_MAX_TIME_QUANTA; tqNum >= CTRL1_MIN_TIME_QUANTA; tqNum--)
    {
        clk = baudRate * tqNum;
        if (clk > sourceClock_Hz)
        {
            continue; /* tqNum too large, clk has been exceed sourceClock_Hz. */
        }

        for (pconfig->preDivider = 0x00U; pconfig->preDivider <= MAX_PRESDIV; (pconfig->preDivider)++)
        {
            /* Consider some proessor not contain FPU, the parameter need to be exact division. */
            if ((clk / ((uint32_t)pconfig->preDivider + 1UL) * ((uint32_t)pconfig->preDivider + 1UL)) != clk)
            {
                continue; /* clk need to be exact division by preDivider + 1. */
            }
            clk2 = clk / ((uint32_t)pconfig->preDivider + 1UL);
            if (((sourceClock_Hz / clk2) * clk2) != sourceClock_Hz)
            {
                continue; /* sourceClock_Hz need to be exact division by preDivider. */
            }
            FLEXCAN_GetSegments(baudRate, tqNum, pconfig);
            return true;
        }
    }
    /* failed to find solution. */
    return false;
}

#if (defined(FSL_FEATURE_FLEXCAN_HAS_FLEXIBLE_DATA_RATE) && FSL_FEATURE_FLEXCAN_HAS_FLEXIBLE_DATA_RATE)
static uint32_t FLEXCAN_GetFDMailboxOffset(CAN_Type *base, uint8_t mbIdx)
{
    uint32_t dataSize;
    uint32_t offset = 0;
    dataSize        = (base->FDCTRL & CAN_FDCTRL_MBDSR0_MASK) >> CAN_FDCTRL_MBDSR0_SHIFT;
    switch (dataSize)
    {
        case (uint32_t)kFLEXCAN_8BperMB:
            offset = (((uint32_t)mbIdx / 32U) * 512U + ((uint32_t)mbIdx % 32U) * 16U);
            break;
        case (uint32_t)kFLEXCAN_16BperMB:
            offset = (((uint32_t)mbIdx / 21U) * 512U + ((uint32_t)mbIdx % 21U) * 24U);
            break;
        case (uint32_t)kFLEXCAN_32BperMB:
            offset = (((uint32_t)mbIdx / 12U) * 512U + ((uint32_t)mbIdx % 12U) * 40U);
            break;
        case (uint32_t)kFLEXCAN_64BperMB:
            offset = (((uint32_t)mbIdx / 7U) * 512U + ((uint32_t)mbIdx % 7U) * 72U);
            break;
        default:
            /* All the cases have been listed above, the default clause should not be reached. */
            assert(false);
            break;
    }
    /* To get the dword aligned offset, need to divide by 4. */
    offset = offset / 4U;
    return offset;
}

/*!
 * @brief Calculates the segment values for a single bit time for CANFD bus control baud Rate
 *
 * @param baudRate The canfd bus control speed in bps
 * @param tqNum Number of time quanta per bit
 * @param pconfig Pointer to the FlexCAN timing configuration structure.
 *
 */
static void FLEXCAN_FDGetSegments(uint32_t baudRate, uint32_t tqNum, flexcan_timing_config_t *pconfig)
{
    uint32_t ideal_sp;
    uint32_t p1;

    /* get ideal sample point. */
    if (baudRate >= 1000000UL)
    {
        ideal_sp = IDEAL_SP_LOW;
    }
    else if (baudRate >= 800000UL)
    {
        ideal_sp = IDEAL_SP_MID;
    }
    else
    {
        ideal_sp = IDEAL_SP_HIGH;
    }

    /* distribute time quanta. */
    p1                 = tqNum * (uint32_t)ideal_sp;
    pconfig->propSeg   = 0U;
    pconfig->phaseSeg1 = (uint8_t)(p1 / IDEAL_SP_FACTOR - 2UL);
    if (pconfig->phaseSeg1 > (MAX_EPSEG1 + MAX_EPROPSEG))
    {
        pconfig->phaseSeg1 = MAX_EPSEG1;
        pconfig->propSeg   = MAX_EPROPSEG;
    }
    else if (pconfig->phaseSeg1 > MAX_EPSEG1)
    {
        pconfig->propSeg   = pconfig->phaseSeg1 - MAX_EPSEG1;
        pconfig->phaseSeg1 = MAX_EPSEG1;
    }
    else
    {
        /* MISRA Compatible */
    }

    pconfig->phaseSeg2 = (uint8_t)(tqNum - ((uint32_t)pconfig->phaseSeg1 + (uint32_t)pconfig->propSeg + 4U));
    assert(pconfig->phaseSeg2 <= MAX_EPSEG2);

    /* subtract one TQ for sync seg. */
    /* sjw is 20% of total TQ, rounded to nearest int. */
    pconfig->rJumpwidth = (uint8_t)((tqNum + 4UL) / 5UL - 1UL);
    /* the max tqNum for CBT will reach to 129, ERJW would not larger than 26. */
    /* Consider and max ERJW is 31, so rJumpwidth will always smaller than MAX_ERJW. */
    assert(pconfig->rJumpwidth <= MAX_ERJW);
}

/*!
 * @brief Calculates the segment values for a single bit time for CANFD bus data baud Rate
 *
 * @param baudRate The canfd bus data speed in bps
 * @param tqNum Number of time quanta per bit
 * @param pconfig Pointer to the FlexCAN timing configuration structure.
 *
 */
static void FLEXCAN_FDGetSegmentswithBRS(uint32_t baudRateFD, uint32_t tqNum, flexcan_timing_config_t *pconfig)
{
    uint32_t ideal_sp;
    uint32_t p1;

    /* get ideal sample point. */
    if (baudRateFD >= 1000000UL)
    {
        ideal_sp = IDEAL_SP_LOW;
    }
    else if (baudRateFD >= 800000UL)
    {
        ideal_sp = IDEAL_SP_MID;
    }
    else
    {
        ideal_sp = IDEAL_SP_HIGH;
    }

    /* distribute time quanta. */
    p1                  = tqNum * (uint32_t)ideal_sp;
    pconfig->fpropSeg   = 0U;
    pconfig->fphaseSeg1 = (uint8_t)(p1 / IDEAL_SP_FACTOR - 1UL);
    if (pconfig->fphaseSeg1 > (MAX_FPSEG1 + MAX_FPROPSEG))
    {
        pconfig->fphaseSeg1 = MAX_FPSEG1;
        pconfig->fpropSeg   = MAX_FPROPSEG;
    }
    else if (pconfig->fphaseSeg1 > MAX_FPSEG1)
    {
        pconfig->fpropSeg   = pconfig->fphaseSeg1 - MAX_FPSEG1;
        pconfig->fphaseSeg1 = MAX_FPSEG1;
    }
    else
    {
        /* MISRA Rule 15.7 Compatible */
    }

    pconfig->fphaseSeg2 = (uint8_t)(tqNum - ((uint32_t)pconfig->fphaseSeg1 + (uint32_t)pconfig->fpropSeg + 3UL));

    assert(pconfig->fphaseSeg2 <= MAX_FPSEG2);

    /* subtract one TQ for sync seg. */
    /* sjw is 20% of total TQ, rounded to nearest int. */
    pconfig->frJumpwidth = (uint8_t)((tqNum + 4UL) / 5UL - 1UL);

    if (pconfig->frJumpwidth > MAX_FRJW)
    {
        pconfig->frJumpwidth = MAX_FRJW;
    }
}

/*!
 * @brief Calculates the improved timing values by specific baudrates for CANFD
 *
 * @param baudRate  The CANFD bus control speed in bps defined by user
 * @param baudRateFD  The CANFD bus data speed in bps defined by user
 * @param sourceClock_Hz The Source clock data speed in bps. Zero to disable baudrate switching
 * @param pconfig Pointer to the FlexCAN timing configuration structure.
 *
 * @return TRUE if timing configuration found, FALSE if failed to find configuration
 */
bool FLEXCAN_FDCalculateImprovedTimingValues(uint32_t baudRate,
                                             uint32_t baudRateFD,
                                             uint32_t sourceClock_Hz,
                                             flexcan_timing_config_t *pconfig)
{
    uint32_t clk, clkbrs;
    uint32_t clk2, clkbrs2;
    uint32_t tqNum, tqNumbrs; /* Numbers of TQ. */

    /* observe baud rate maximums */
    assert(baudRate <= MAX_CAN_BAUDRATE);
    assert(baudRateFD <= MAX_CANFD_BAUDRATE);

    /*  Auto Improved Protocal timing for CBT. */
    for (tqNum = CBT_MAX_TIME_QUANTA; tqNum >= CBT_MIN_TIME_QUANTA; tqNum--)
    {
        clk = baudRate * tqNum;
        if (clk > sourceClock_Hz)
        {
            continue; /* tqNum too large, clk x tqNum has been exceed sourceClock_Hz. */
        }

