Masmiseim36/nxpSDK/devices/MKW38Z4/drivers/fsl_flexcan.c
    /* Un-register handle. */
    handle->mbFDFrameBuf[mbIdx] = NULL;
    handle->mbState[mbIdx]      = (uint8_t)kFLEXCAN_StateIdle;
}
#endif

/*!
 * brief Aborts the interrupt driven message receive process.
 *
 * This function aborts the interrupt driven message receive process.
 *
 * param base FlexCAN peripheral base address.
 * param handle FlexCAN handle pointer.
 * param mbIdx The FlexCAN Message Buffer index.
 */
void FLEXCAN_TransferAbortReceive(CAN_Type *base, flexcan_handle_t *handle, uint8_t mbIdx)
{
    /* Assertion. */
    assert(NULL != handle);
    assert(mbIdx <= (base->MCR & CAN_MCR_MAXMB_MASK));
    assert(FLEXCAN_IsMbOccupied(base, mbIdx) == false);

/* Disable Message Buffer Interrupt. */
#if (defined(FSL_FEATURE_FLEXCAN_HAS_EXTENDED_FLAG_REGISTER)) && (FSL_FEATURE_FLEXCAN_HAS_EXTENDED_FLAG_REGISTER > 0)
    uint64_t u64mask = 1;
    FLEXCAN_DisableMbInterrupts(base, (u64mask << mbIdx));
#else
    uint32_t u32mask = 1;
    FLEXCAN_DisableMbInterrupts(base, (u32mask << mbIdx));
#endif

    /* Un-register handle. */
    handle->mbFrameBuf[mbIdx] = NULL;
    handle->mbState[mbIdx]    = (uint8_t)kFLEXCAN_StateIdle;
}

/*!
 * brief Aborts the interrupt driven message receive from Rx FIFO process.
 *
 * This function aborts the interrupt driven message receive from Rx FIFO process.
 *
 * param base FlexCAN peripheral base address.
 * param handle FlexCAN handle pointer.
 */
void FLEXCAN_TransferAbortReceiveFifo(CAN_Type *base, flexcan_handle_t *handle)
{
    /* Assertion. */
    assert(NULL != handle);

    /* Check if Rx FIFO is enabled. */
    if (0U != (base->MCR & CAN_MCR_RFEN_MASK))
    {
        /* Disable Rx Message FIFO Interrupts. */
        FLEXCAN_DisableMbInterrupts(base, (uint32_t)kFLEXCAN_RxFifoOverflowFlag | (uint32_t)kFLEXCAN_RxFifoWarningFlag |
                                              (uint32_t)kFLEXCAN_RxFifoFrameAvlFlag);

        /* Un-register handle. */
        handle->rxFifoFrameBuf = NULL;
    }

    handle->rxFifoState = (uint8_t)kFLEXCAN_StateIdle;
}

/*!
 * @brief Sub Handler Mail Box Trasfered Events
 *
 * @param base FlexCAN peripheral base address.
 * @param handle FlexCAN handle pointer.
 * @param pResult Pointer to the Handle result.
 * @return the status after handle each data transfered event.
 */
static status_t FLEXCAN_SubHandlerForMailBoxTransfered(CAN_Type *base, flexcan_handle_t *handle, uint32_t mbIdx)
{
    status_t status = kStatus_FLEXCAN_UnHandled;

    /* Get current State of Message Buffer. */
    switch (handle->mbState[mbIdx])
    {
        /* Solve Rx Data Frame or Rx Remote Frame. */
        case (uint8_t)kFLEXCAN_StateRxData:
        case (uint8_t)kFLEXCAN_StateRxRemote:
#if (defined(FSL_FEATURE_FLEXCAN_HAS_FLEXIBLE_DATA_RATE) && FSL_FEATURE_FLEXCAN_HAS_FLEXIBLE_DATA_RATE)
            if (0U != (base->MCR & CAN_MCR_FDEN_MASK))
            {
                status = FLEXCAN_ReadFDRxMb(base, (uint8_t)mbIdx, handle->mbFDFrameBuf[mbIdx]);
            }
            else
            {
                status = FLEXCAN_ReadRxMb(base, (uint8_t)mbIdx, handle->mbFrameBuf[mbIdx]);
            }
#else
            status = FLEXCAN_ReadRxMb(base, mbIdx, handle->mbFrameBuf[mbIdx]);
#endif
            if (kStatus_Success == status)
            {
                status = kStatus_FLEXCAN_RxIdle;
            }
#if (defined(FSL_FEATURE_FLEXCAN_HAS_FLEXIBLE_DATA_RATE) && FSL_FEATURE_FLEXCAN_HAS_FLEXIBLE_DATA_RATE)
            if (0U != (base->MCR & CAN_MCR_FDEN_MASK))
            {
                FLEXCAN_TransferFDAbortReceive(base, handle, (uint8_t)mbIdx);
            }
            else
            {
                FLEXCAN_TransferAbortReceive(base, handle, (uint8_t)mbIdx);
            }
#else
            FLEXCAN_TransferAbortReceive(base, handle, mbIdx);
#endif
            break;

        /* Solve Tx Data Frame. */
        case (uint8_t)kFLEXCAN_StateTxData:
            status = kStatus_FLEXCAN_TxIdle;
#if (defined(FSL_FEATURE_FLEXCAN_HAS_FLEXIBLE_DATA_RATE) && FSL_FEATURE_FLEXCAN_HAS_FLEXIBLE_DATA_RATE)
            if (0U != (base->MCR & CAN_MCR_FDEN_MASK))
            {
                FLEXCAN_TransferFDAbortSend(base, handle, (uint8_t)mbIdx);
            }
            else
            {
                FLEXCAN_TransferAbortSend(base, handle, (uint8_t)mbIdx);
            }
#else
            FLEXCAN_TransferAbortSend(base, handle, mbIdx);
#endif
            break;

        /* Solve Tx Remote Frame. */
        case (uint8_t)kFLEXCAN_StateTxRemote:
            handle->mbState[mbIdx] = (uint8_t)kFLEXCAN_StateRxRemote;
            status                 = kStatus_FLEXCAN_TxSwitchToRx;
            break;

        default:
            status = kStatus_FLEXCAN_UnHandled;
            break;
    }

    return status;
}

/*!
 * brief FlexCAN IRQ handle function.
 *
 * This function handles the FlexCAN Error, the Message Buffer, and the Rx FIFO IRQ request.
 *
 * param base FlexCAN peripheral base address.
 * param handle FlexCAN handle pointer.
 */
void FLEXCAN_TransferHandleIRQ(CAN_Type *base, flexcan_handle_t *handle)
{
    /* Assertion. */
    assert(NULL != handle);

    status_t status = kStatus_FLEXCAN_UnHandled;
    uint32_t result = 0U;
    /* Store Current FlexCAN Module Error and Status. */
    uint32_t EsrStatus = base->ESR1;

    do
    {
        /* Solve FlexCAN Error and Status Interrupt. */
        if (0U != (EsrStatus & ((uint32_t)kFLEXCAN_TxWarningIntFlag | (uint32_t)kFLEXCAN_RxWarningIntFlag |
                                (uint32_t)kFLEXCAN_BusOffIntFlag | (uint32_t)kFLEXCAN_ErrorIntFlag)))
        {
            status = kStatus_FLEXCAN_ErrorStatus;

            /* Clear FlexCAN Error and Status Interrupt. */
            FLEXCAN_ClearStatusFlags(base, (uint32_t)kFLEXCAN_TxWarningIntFlag | (uint32_t)kFLEXCAN_RxWarningIntFlag |
                                               (uint32_t)kFLEXCAN_BusOffIntFlag | (uint32_t)kFLEXCAN_ErrorIntFlag);
        }
        else if (0U != (EsrStatus & (uint32_t)kFLEXCAN_WakeUpIntFlag))
        {
            status = kStatus_FLEXCAN_WakeUp;
            FLEXCAN_ClearStatusFlags(base, (uint32_t)kFLEXCAN_WakeUpIntFlag);
        }
        /* Solve FlexCAN Rx FIFO & Message Buffer Interrupt. */
        else
        {
            /* For this implementation, we solve the Message with lowest MB index first. */
            for (result = 0U; result < (uint32_t)FSL_FEATURE_FLEXCAN_HAS_MESSAGE_BUFFER_MAX_NUMBERn(base); result++)
            {
/* Get the lowest unhandled Message Buffer */
#if (defined(FSL_FEATURE_FLEXCAN_HAS_EXTENDED_FLAG_REGISTER)) && (FSL_FEATURE_FLEXCAN_HAS_EXTENDED_FLAG_REGISTER > 0)
                uint64_t u64flag = 1;
                if (0U != FLEXCAN_GetMbStatusFlags(base, (u64flag << result)))
                {
                    if (true == FLEXCAN_IsMbIntEnabled(base, result))
#else
                uint32_t u32flag = 1;
                if (0U != FLEXCAN_GetMbStatusFlags(base, (u32flag << result)))
                {
                    if (true == FLEXCAN_IsMbIntEnabled(base, (uint8_t)result))
#endif
                    {
                        break;
                    }
                }
            }

            /* Does not find Message to deal with. */
            if (result == (uint32_t)FSL_FEATURE_FLEXCAN_HAS_MESSAGE_BUFFER_MAX_NUMBERn(base))
            {
                break;
            }

